# AnalyticalModelEndProjectionOrthogonal Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AnalyticalModelEndProjectionOrthogonal Property
ParameterTypeId Class See Also
---
"End Projection Orthogonal"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AnalyticalModelEndProjectionOrthogonal { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalModelEndProjectionOrthogonal As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AnalyticalModelEndProjectionOrthogonal {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace